<?php
/**
 * Template part for displaying "for whom" section
 *
 * @link https://developer.wordpress.org/themes/basics/template-hierarchy/
 *
 * @package UX_Mind_School
 */
?>
<div class="for-whom">
    <div class="row">
        <div class="col-12 col-lg-4">
            <h3 class="section__title title title_style-dark title_size-m for-whom__title">
                <?php if ($term_id == 3): ?>Для кого?<?php else: ?>Кому подойдет этот курс?<?php endif; ?>
                <svg width="38" height="40" viewBox="0 0 38 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M19 37.7977C29.4934 37.7977 38 29.3364 38 18.8989C38 8.46131 29.4934 0 19 0C8.50659 0 0 8.46131 0 18.8989C0 29.3364 8.50659 37.7977 19 37.7977Z"
                        fill="#FFCB4C" />
                    <path
                        d="M15.1142 23.3655C14.9522 23.2365 14.8259 23.0609 14.7655 22.8497C14.6158 22.3383 14.9108 21.8291 15.4249 21.7146C20.4857 20.5796 23.8934 23.2299 24.0375 23.3433C24.4667 23.6834 24.5505 24.2826 24.2309 24.6829C23.9112 25.0808 23.3055 25.1286 22.8774 24.7907C22.7545 24.6973 20.0576 22.6529 15.9681 23.57C15.6619 23.6379 15.3489 23.5523 15.1142 23.3655Z"
                        fill="#65471B" />
                    <path
                        d="M13.5449 15.3546C14.8566 15.3546 15.9199 14.0326 15.9199 12.4019C15.9199 10.7712 14.8566 9.44922 13.5449 9.44922C12.2332 9.44922 11.1699 10.7712 11.1699 12.4019C11.1699 14.0326 12.2332 15.3546 13.5449 15.3546Z"
                        fill="#65471B" />
                    <path
                        d="M26.125 16.5352C27.4367 16.5352 28.5 15.2133 28.5 13.5826C28.5 11.9518 27.4367 10.6299 26.125 10.6299C24.8133 10.6299 23.75 11.9518 23.75 13.5826C23.75 15.2133 24.8133 16.5352 26.125 16.5352Z"
                        fill="#65471B" />
                    <path
                        d="M18.1902 39.0553C18.1902 39.0553 19.6041 38.5984 19.7874 37.5523C19.9807 36.4717 19.0899 36.2549 19.0899 36.2549C19.0899 36.2549 20.2534 36.0237 20.3998 34.7252C20.5373 33.5012 19.4375 33.21 19.4375 33.21C19.4375 33.21 20.5216 32.7653 20.5731 31.4991C20.6155 30.433 19.461 29.9116 19.461 29.9116C19.461 29.9116 25.0917 28.5542 25.6706 28.4208C26.2474 28.2874 27.1459 27.7371 26.8654 26.5376C26.5871 25.3369 25.5198 25.2947 24.9688 25.4225C24.4166 25.5504 17.4314 27.1635 15.0217 27.7215L13.4134 28.0928C12.8099 28.234 12.5361 27.9706 12.9619 27.5237C13.5296 26.9278 13.8929 26.2685 14.0192 25.1746C14.1522 24.024 13.7599 22.6033 13.5352 22.0519C13.1172 21.028 12.412 20.2187 11.5972 19.9408C10.3265 19.5072 9.42341 20.2976 9.87382 21.6761C10.5489 23.7372 10.1063 25.4281 8.94282 26.4486C6.20571 28.8466 4.93271 30.5564 5.77988 34.2005C6.7053 38.1748 10.6718 40.7328 14.6674 39.8124L18.1902 39.0553Z"
                        fill="#F19020" />
                    <path
                        d="M9.27162 7.0405C9.08832 6.94267 8.93297 6.79148 8.83462 6.59693C8.5932 6.12113 8.78991 5.56639 9.27385 5.36073C14.0417 3.32521 17.8786 5.31292 18.0396 5.39852C18.5235 5.65533 18.7191 6.22896 18.4766 6.68142C18.2351 7.13166 17.6495 7.28841 17.1656 7.03494C17.0281 6.9649 14.0004 5.44299 10.149 7.08719C9.86173 7.20837 9.53762 7.18169 9.27162 7.0405ZM22.8343 11.2094C22.6599 11.1004 22.5146 10.9392 22.4297 10.738C22.2207 10.2466 22.4554 9.70746 22.9527 9.53293C27.8491 7.82536 31.5419 10.0665 31.6961 10.1633C32.1599 10.4523 32.3164 11.0382 32.0448 11.4728C31.7743 11.9064 31.1775 12.0231 30.7137 11.7374C30.5796 11.6574 27.6659 9.93536 23.7094 11.3161C23.4121 11.4173 23.0913 11.3672 22.8343 11.2094Z"
                        fill="#65471B" />
                </svg>
            </h3>
        </div>
        <div class="col-6 col-lg-2">
            <div class="for-whom__item">
                <div class="for-whom__icon for-whom__icon_position-1">
                    <img src="<?php echo get_template_directory_uri(); ?>/img/whom-1.svg" alt="<?php echo get_bloginfo('name'); ?>">
                </div>
                <p class="for-whom__name">Тем, кому интересен дизайн</p>
            </div>
        </div>
        <div class="col-6 col-lg-2">
            <div class="for-whom__item">
                <div class="for-whom__icon for-whom__icon_position-2">
                    <img src="<?php echo get_template_directory_uri(); ?>/img/whom-2.svg" alt="<?php echo get_bloginfo('name'); ?>">
                </div>
                <p class="for-whom__name">Начинающим дизайнерам</p>
            </div>
        </div>
        <div class="col-6 col-lg-2">
            <div class="for-whom__item">
                <div class="for-whom__icon for-whom__icon_position-3">
                    <img src="<?php echo get_template_directory_uri(); ?>/img/whom-3.svg" alt="<?php echo get_bloginfo('name'); ?>">
                </div>
                <p class="for-whom__name">Дизайнерам из смежных областей</p>
            </div>
        </div>
        <div class="col-6 col-lg-2">
            <div class="for-whom__item">
                <div class="for-whom__icon for-whom__icon_position-4">
                    <img src="<?php echo get_template_directory_uri(); ?>/img/whom-4.svg" alt="<?php echo get_bloginfo('name'); ?>"> 
                </div>
                <p class="for-whom__name">Кто хочет расширить компетенции</p>
            </div>
        </div>
    </div>
</div>